## Terraform Plan
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 3 to add, 3 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                                NAME                                                 |
|--------|-----------------------------------------------------------------------------------------------------|
| add    | `module.block_device_code_flow.azuread_conditional_access_policy.this`                              |
|        | `module.dev_ai_api_key.azurerm_cognitive_deployment.deployment[&quot;openai-gpt51&quot;]`                     |
|        | `module.dev_ai_api_key.azurerm_consumption_budget_resource_group.openai_budget`                     |
| update | `azurerm_monitor_action_group.SRE_GR_AG`                                                            |
|        | `module.breakglass_account_signin_attempt.azurerm_monitor_scheduled_query_rules_alert_v2.this`      |
|        | `module.conditional_access_policy_modification.azurerm_monitor_scheduled_query_rules_alert_v2.this` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_monitor_action_group.SRE_GR_AG will be updated in-place
  ~ resource "azurerm_monitor_action_group" "SRE_GR_AG" {
        id                  = "/subscriptions/6881deca-df81-4b95-ad54-103b0b100a1d/resourceGroups/cds-snc-mgmt/providers/Microsoft.Insights/actionGroups/SRE-GR-AG"
        name                = "SRE-GR-AG"
      ~ tags                = {
            "ClientOrganization" = "cds-snc"
            "CostCenter"         = "sentinel"
            "DataSensitivity"    = "U"
            "ProjectContact"     = "Security@CDS"
            "ProjectName"        = "Sentinel"
            "TechnicalContact"   = "security@cds-snc.ca"
          - "division"           = "CDS" -> null
            "ssc_cbrid"          = "21JA"
        }
        # (4 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.block_device_code_flow.azuread_conditional_access_policy.this will be created
  + resource "azuread_conditional_access_policy" "this" {
      + display_name = "Block Device Code Flow"
      + id           = (known after apply)
      + object_id    = (known after apply)
      + state        = "enabled"

      + conditions {
          + authentication_flow_transfer_methods = [
              + "deviceCodeFlow",
            ]
          + client_app_types                     = [
              + "all",
            ]
          + insider_risk_levels                  = (known after apply)

          + applications {
              + excluded_applications = []
              + included_applications = [
                  + "All",
                ]
            }

          + users {
              + excluded_groups = []
              + excluded_roles  = []
              + excluded_users  = []
              + included_groups = []
              + included_roles  = []
              + included_users  = [
                  + "All",
                ]
            }
        }

      + grant_controls {
          + built_in_controls = [
              + "block",
            ]
          + operator          = "OR"
        }
    }

  # module.breakglass_account_signin_attempt.azurerm_monitor_scheduled_query_rules_alert_v2.this will be updated in-place
  ~ resource "azurerm_monitor_scheduled_query_rules_alert_v2" "this" {
        id                                     = "/subscriptions/6881deca-df81-4b95-ad54-103b0b100a1d/resourceGroups/cds-snc-mgmt/providers/Microsoft.Insights/scheduledQueryRules/Breakglass Account Signin Attempt"
        name                                   = "Breakglass Account Signin Attempt"
      ~ tags                                   = {
            "ClientOrganization" = "cds-snc"
            "CostCenter"         = "sentinel"
            "DataSensitivity"    = "U"
            "ProjectContact"     = "Security@CDS"
            "ProjectName"        = "Sentinel"
            "TechnicalContact"   = "security@cds-snc.ca"
          - "division"           = "CDS" -> null
            "ssc_cbrid"          = "21JA"
        }
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.conditional_access_policy_modification.azurerm_monitor_scheduled_query_rules_alert_v2.this will be updated in-place
  ~ resource "azurerm_monitor_scheduled_query_rules_alert_v2" "this" {
        id                                     = "/subscriptions/6881deca-df81-4b95-ad54-103b0b100a1d/resourceGroups/cds-snc-mgmt/providers/Microsoft.Insights/scheduledQueryRules/Conditional Access Policy Modification"
        name                                   = "Conditional Access Policy Modification"
      ~ tags                                   = {
            "ClientOrganization" = "cds-snc"
            "CostCenter"         = "sentinel"
            "DataSensitivity"    = "U"
            "ProjectContact"     = "Security@CDS"
            "ProjectName"        = "Sentinel"
            "TechnicalContact"   = "security@cds-snc.ca"
          - "division"           = "CDS" -> null
            "ssc_cbrid"          = "21JA"
        }
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.dev_ai_api_key.azurerm_cognitive_deployment.deployment["openai-gpt51"] will be created
  + resource "azurerm_cognitive_deployment" "deployment" {
      + cognitive_account_id   = "/subscriptions/204b7832-86f3-4792-8e35-860862258324/resourceGroups/yazzttz-dev-ai-api-key/providers/Microsoft.CognitiveServices/accounts/dev-ai-api-key-yazzttz"
      + id                     = (known after apply)
      + name                   = "openai-gpt51"
      + version_upgrade_option = "OnceNewDefaultVersionAvailable"

      + model {
          + format  = "OpenAI"
          + name    = "gpt-5.1"
          + version = "2025-11-13"
        }

      + sku {
          + capacity = 500
          + name     = "GlobalStandard"
        }
    }

  # module.dev_ai_api_key.azurerm_consumption_budget_resource_group.openai_budget will be created
  + resource "azurerm_consumption_budget_resource_group" "openai_budget" {
      + amount            = 25
      + etag              = (known after apply)
      + id                = (known after apply)
      + name              = "openai-budget"
      + resource_group_id = "/subscriptions/204b7832-86f3-4792-8e35-860862258324/resourceGroups/yazzttz-dev-ai-api-key"
      + time_grain        = "Monthly"

      + notification {
          + contact_emails = [
              + "sre-ifs@cds-snc.ca",
              + "sylvia.mclaughlin@cds-snc.ca",
            ]
          + contact_groups = []
          + contact_roles  = []
          + enabled        = true
          + operator       = "EqualTo"
          + threshold      = 80
          + threshold_type = "Forecasted"
        }

      + time_period {
          + end_date   = "2035-02-01T00:00:00Z"
          + start_date = "2025-02-01T00:00:00Z"
        }
    }

Plan: 3 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["azurerm_monitor_action_group.SRE_GR_AG"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers_api_key.azurerm_cognitive_account.openai"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers_api_key.azurerm_resource_group.rg"]
WARN - plan.json - main - Missing Common Tags: ["module.breakglass_account_signin_attempt.azurerm_monitor_scheduled_query_rules_alert_v2.this"]
WARN - plan.json - main - Missing Common Tags: ["module.conditional_access_policy_modification.azurerm_monitor_scheduled_query_rules_alert_v2.this"]
WARN - plan.json - main - Missing Common Tags: ["module.dev_ai_api_key.azurerm_cognitive_account.openai"]
WARN - plan.json - main - Missing Common Tags: ["module.dev_ai_api_key.azurerm_resource_group.rg"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_core_hackathon_api_key.azurerm_cognitive_account.openai"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_core_hackathon_api_key.azurerm_resource_group.rg"]
WARN - plan.json - main - Missing Common Tags: ["module.valentine_api_key.azurerm_cognitive_account.openai"]
WARN - plan.json - main - Missing Common Tags: ["module.valentine_api_key.azurerm_resource_group.rg"]

30 tests, 19 passed, 11 warnings, 0 failures, 0 exceptions

```

</details>
